In [7]:
import pandas as pd
import sqlite3

In [14]:
#Criando conexao
connection = sqlite3.connect('banco.db')

In [15]:
#Referenciando a tabela a ser analisada
table = pd.read_sql_query('SELECT * FROM dados', connection)

In [16]:
print(table)

    BusinessEntityID PersonType NameStyle Title  FirstName MiddleName  \
0                  1         EM         0  NULL        Ken          J
1                  2         EM         0  NULL      Terri        Lee
2                  3         EM         0  NULL    Roberto       NULL
3                  4         EM         0  NULL        Rob       NULL
4                  5         EM         0   Ms.       Gail          A
..               ...        ...       ...   ...        ...        ...
995             1700         IN         0   Ms.    Rebecca         A.
996             1701         IN         0   Ms.    Dorothy         B.
997             1702         IN         0   Ms.  Carol Ann         F.
998             1703         IN         0   Mr.      Scott         M.
999             1704         IN         0   Mr.        Jim       NULL

       LastName Suffix EmailPromotion
0       SÃ¡nchez   NULL              0
1         Duffy   NULL              1
2    Tamburello   NULL              0
3       Walters   NULL              0
4      Erickson   NULL              0
..          ...    ...            ...
995    Robinson   NULL              0
996    Robinson   NULL              2
997      Rockne   NULL              0
998     Rodgers   NULL              0
999      Rodman   NULL              0

[1000 rows x 9 columns]

In [22]:
#Comando SQL
sql = "SELECT FirstName FROM dados LIMIT 10"

In [23]:
#Executando o comando
dados = pd.read_sql_query(sql, connection)

In [25]:
#Exibindo os dados filtrados
dados

  FirstName
0        A.
1  A. Scott
2     Aaron
3   Abigail
4      Adam
5      Adam
6    Adrian
7     Aidan
8      Ajay
9      Alan

In [26]:
connection.close()